{
	"block.nostrumaetheria.infinite_aether_block": "Infinite Aether Block",
    "block.nostrumaetheria.aether_battery_small": "Small Aether Battery",
    "block.nostrumaetheria.aether_battery_medium": "Aether Battery",
    "block.nostrumaetheria.aether_battery_large": "Reinforced Aether Battery",
    "block.nostrumaetheria.aether_battery_giant": "Heavy Aether Battery",
    "block.nostrumaetheria.aether_relay": "Aether Relay",
    "block.nostrumaetheria.aether_furnace_small": "Aether Furnace",
    "block.nostrumaetheria.aether_furnace_medium": "Large Aether Furnace",
    "block.nostrumaetheria.aether_furnace_large": "Giant Aether Furnace",
    "block.nostrumaetheria.aether_boiler_block": "Aether Boiler",
    "block.nostrumaetheria.aether_charger": "Aether Charger",
    "block.nostrumaetheria.aether_repairer": "Aether Repairer",
    "block.nostrumaetheria.aether_bath": "Aether Bath",
    "block.nostrumaetheria.aether_unraveler": "Aether Unraveler",
    "block.nostrumaetheria.aether_pump": "Aether Pump",
    "block.nostrumaetheria.wisp_block": "Wisp Crystal",
    "block.nostrumaetheria.infuser_multiblk": "Aether Infuser",
	"block.nostrumaetheria.enhanced_aether_relay": "Enhanced Aether Relay",

    "item.nostrumaetheria.pendant_active": "Lyon Pendant",
    "item.nostrumaetheria.pendant_passive": "Aen Pendant",
    "item.nostrumaetheria.aether_gem": "Aether Gem",
    "item.nostrumaetheria.aether_battery_cart_item": "Aether Cart",
    "item.nostrumaetheria.shield_ring_small": "Shield Ring",
    "item.nostrumaetheria.shield_ring_small.desc": "Uses aether to protect the wearer with a magical shield",
    "item.nostrumaetheria.shield_ring_large": "Strong Shield Ring",
    "item.nostrumaetheria.shield_ring_large.desc": "Uses aether to protect the wearer with a magical shield",
    "item.nostrumaetheria.elude_cloak": "Elusion Cloak",
    "item.nostrumaetheria.elude_cloak.desc": "Uses aether to automatically dodge attacks",
    "item.nostrumaetheria.aether_cloak": "Aether Cloak",
    "item.nostrumaetheria.aether_cloak.desc": "Stores up large amounts of Aether|%2$s+25%% Mana Regen%1$s",
	"item.nostrumaetheria.aether_sight_item": "Aether Sight Glass",
	"item.nostrumaetheria.aether_sight_pendant": "Aether Sight Pendant",

    "item.nostrumaetheria.aether_resource_ginseng_flower": "Ginseng Flower",
    "item.nostrumaetheria.aether_resource_mandrake_flower": "Mandrake Bloom",
	
	"item.nostrumaetheria.lens_spread": "Spread Lens",
    "item.nostrumaetheria.lens_spread.desc": "Spreads aether to lenses on nearby Altars",
    "item.nostrumaetheria.lens_wide_charge": "Charge Lens",
    "item.nostrumaetheria.lens_wide_charge.desc": "Charges items in distant players' inventories",
    "item.nostrumaetheria.lens_grow": "Growth Lens",
    "item.nostrumaetheria.lens_grow.desc": "Grows nearby crops",
    "item.nostrumaetheria.lens_swiftness": "Speed Lens",
    "item.nostrumaetheria.lens_swiftness.desc": "Gives a speed effect to nearby players",
    "item.nostrumaetheria.lens_elevator": "Elevator Lens",
    "item.nostrumaetheria.lens_elevator.desc": "Lifts any non-sneaking jumping players around the lens",
    "item.nostrumaetheria.lens_heal": "Heal Lens",
    "item.nostrumaetheria.lens_heal.desc": "Heals nearby players",
    "item.nostrumaetheria.lens_bore": "Bore Lens",
    "item.nostrumaetheria.lens_bore.desc": "Digs a large hole under the lens",
    "item.nostrumaetheria.lens_bore_reversed": "Reversed Bore Lens",
    "item.nostrumaetheria.lens_bore_reversed.desc": "Digs up instead of down",
    "item.nostrumaetheria.lens_mana_regen": "Mana Regen Lens",
    "item.nostrumaetheria.lens_mana_regen.desc": "Restores mana to nearby magic entities",
    "item.nostrumaetheria.lens_no_spawn": "Anti-Spawn Lens",
    "item.nostrumaetheria.lens_no_spawn.desc": "Prevents mob spawning in a large area around the lens",

    "item.aether_cloak.runed": "Runed",
    "item.aether_cloak.wings": "Display Wings",
    "item.aether_cloak.trimmed": "Trimmed Design",
    "item.aether_cloak.color.outside": "Outside Dyed %s",
    "item.aether_cloak.color.inside": "Inside Dyed %s",
    "item.aether_cloak.color.runes": "Rune Color %s",
    "item.aether_cloak.spender": "Aether Caster",

    "item.lens.master": "Master Lens",

    "item.info.lyon.desc": "Charged up by slowly consuming reagents. Provides reagent-free casts.",
    "item.info.aen.desc": "Charged up with Aether. Provides reagent-free casts.",
    "item.info.pendant.charges": "%d Charges",
    "item.info.aether_gem.desc": "Stores aether and provides it to other items in your inventory",
    "item.info.aether": "%s / %s",
	
	"info.relay.already_linked": "These relays are already linked",
	"info.relay.too_far": "The stored location is too far away",

    "itemGroup.nostrumaetheria": "Nostrum Aetheria",

    "entity.nostrumaetheria.aether_battery_cart.name": "Aether Cart",

    "gui.aether_boiler.mode.focus_aether": "Active until aether full",
    "gui.aether_boiler.mode.focus_furnace": "Active while furnace is cooking",
    "gui.aether_boiler.mode.focus_both": "Active until aether full and furnace is done",
    "gui.aether_boiler.mode.always_on": "Always active",

    "ritual.active_pendant.name": "Lyon Infusion",
    "ritual.passive_pendant.name": "Aen Infusion",
    "ritual.aether_furnace_small.name": "Craft Small Aether Furnace",
    "ritual.aether_furnace_medium.name": "Craft Medium Aether Furnace",
    "ritual.aether_furnace_large.name": "Craft Large Aether Furnace",
    "ritual.aether_boiler.name": "Craft Aether Boiler",
    "ritual.aether_bath.name": "Craft Aether Bath",
    "ritual.aether_charger.name": "Craft Aether Charger",
    "ritual.aether_repairer.name": "Craft Ather Repairer",
    "ritual.aether_battery_small.name": "Craft Small Aether Battery",
    "ritual.aether_battery_medium.name": "Craft Aether Battery",
    "ritual.aether_battery_large.name": "Craft Reinforced Aether Battery",
    "ritual.aether_battery_giant.name": "Craft Heavy Aether Battery",
    "ritual.aether_gem.name": "Form Aether Gem",
    "ritual.aether_relay.name": "Form Aether Relay",
    "ritual.aether_unraveler.name": "Craft Aether Unraveler",
    "ritual.aether_battery_cart.name": "Craft Aether Cart",
    "ritual.aether_pump.name": "Craft Aether Pump",
	"ritual.enhanced_aether_relay.name": "Enhance Aether Relay",
	"ritual.enhanced_aether_relay_direct.name": "Craft Aether Relay",
	"ritual.aether_sight_item.name": "Craft Aether Sight Glass",
	"ritual.aether_sight_pendant.name": "Enhance Aether Sight Glass",
	"ritual.shield_ring_small.name": "Craft Shield Ring",
    "ritual.shield_ring_large.name": "Craft Strong Shield Ring",
    "ritual.elude_cape_small.name": "Craft Elusion Cloak",
    "ritual.aether_cloak.name": "Craft Aether Cloak",
    "ritual.aether_cloak_caster_upgrade.name": "Aether Caster Upgrade",

    "research.tab.aether.name": "Aetheria",
	"research.tab.aether_gear.name": "Aetheria Gear",

    "research.active_pendant.name": "Lyon Pendants",
    "research.active_pendant.desc": "Like a portable coal engine",
    "research.active_pendant.info": "  Thano pendants have proven to be extremely useful for casting spells that would otherwise cost lots of reagents that are harder to come by. After plenty of use, your mind began to wonder what made them tick, and if they could be improved.|  After lots of investigation and tinkering, you've finally come up with an enhanced version of the Thano pendant. By adding the potency of a fire gem, you've created a pendant that slowly consumes reagents to create charges.|  At first, the idea seemed silly to you; use reagents to get charges to avoid using reagents? However, this new pendant -- which you have called the Lyon Pendant -- consumes any reagent, and accumulates charges that will work for any spell.|  That means those chests full of ginseng and mandrake root can power all of your spells!",
    "research.passive_pendant.name": "Aen Pendants",
    "research.passive_pendant.desc": "Charges directly from aether",
    "research.passive_pendant.info": "  The aether furnace automates and generalizes the process of producing aether. Using the knowledge gained from creating those, you were able to modify the Lyon pendant to directly store aether instead of creating it itself.|  At first, you had difficulty getting the pendants to hold any aether at all. You're not sure how the charges are held, but theorize that some combination of that and the material of the pendant itself makes it difficult for it to store any aether at all.|  Luckily, the ginseng and mandrake flowers you have been studying's affinity for aether was easy to imbue into the pendant. Easy, that is, with the power of a kani gem driving the process!",
    "research.aether_furnace.name": "Aether Furnaces",
    "research.aether_furnace.desc": "Like a really big, non-portable coal engine",
    "research.aether_furnace.info": "  Through your study of spells, reagents, thano and lyon pendants, and mana, you've theorized that reagents provide the substance and direction for a spell while mana provides the energy. This is why, as you understand it, certain spells need certain reagents: the reagents give the mana a form.|  However, thano and lyon pendants both show that the substance and direction are not unique to each reagent. When using a charge from one of these pendants, you feel as if the substance is being provided but YOU provide the direction.|  Following this, you surmise that the magicly driven 'burning' of the reagents in the Lyon pendant is what breaks the reagent down into its bare substance potential and strips away the direction. With this concept in mind, you set out to create a process to perform this more directly.|  After much work, you've created a new type of furnace. In it, you magically burn reagents. The reagents do not produce heat, though. Instead, they produce the direction-less substance potential you theorized earlier -- which you have termed Aether.||  Along the way, you had quite a bit of trouble. The reagent would break down, and seem to vanish. You'd feel a wash of magic-feeling pressure -- which you assume was the aether -- just before puffs of smoke would appear and the pressure would disappear. After some time, you realized this was the aether and the 'direction' that was split from it re-combining and producing regular reagent smoke.|  After a lot of experimentation, you discovered that sprite cores seem to stabilize both substances, allowing you to work with the aether directly.||The furnace works by simply adding reagents. You're not sure why, but burning massive clumps of the same reagent doesn't seem to work. Instead, you've found, aether is produced when burning multiple types of reagents together.",
    "research.aether_furnace_adv.name": "Advanced Aether Furnaces",
    "research.aether_furnace_adv.desc": "Improved aether production",
    "research.aether_furnace_adv.info": "  The aether furnace takes 3 different reagents at a time and breaks them down into Aether. With some modification, you've found ways to upgrade the design of the furnace to get more aether out of each reagent while burning more at a time!",
    "research.aether_boiler.name": "Aether Boiler",
    "research.aether_boiler.desc": "Two burns with one furnace",
    "research.aether_boiler.info": "  While attempting to improve the aether furnace, something continued to bother you. Why don't the aether furnaces produce heat? Is it a good thing that they don't?|  In pursuit of getting more aether faster, you've finally created a furnace that produces heat and aether at the same time by simply adding more fire magic. However, it's now clear that the heat is wasted aether.|  This new block takes reagents and produces less aether than a furnace. However, the additional of a cauldron mean that the heat produced can be used to power furnaces above it. You've decided to call this block the Aether Boiler!||  The boiler is easy to use. Simply place a furnace on top of it and burn reagents in the boiler. The furnace above it will automatically be fueled.|What's more, hoppers placed beneath the furnace act as if they were underneath the furnace.",
    "research.aether_bath.name": "Aether Bath",
    "research.aether_bath.desc": "The birds don't seem to like it as much...",
    "research.aether_bath.info": "  It only took a few reagents before the aether furnace stopped working. You quickly realized this was because the furnace was filled to the brim of aether!|  Using another sprite core, you created a bowl of sorts to pour the aether into for temporary storage.|  After setting it up and having aether flow into it, you realize it looks a bit silly. Additionally, it doesn't even store that much aether. You imagine that, if you had something to soak up aether, though, you could dip it right in!",
    "research.aether_charger.name": "Aether Charger",
    "research.aether_charger.desc": "Less likely to get you confused looks",
    "research.aether_charger.info": "  The aether bath has proved useful for charging items that can hold aether, but it's slow and doesn't seem to store much aether. To fix this, you've created a new block for adding aether to items called the Aether Charger.",
    "research.aether_repairer.name": "Aether Repairer",
    "research.aether_repairer.desc": "Magic anvil",
    "research.aether_repairer.info": "  Aether has proved very useful in providing both energy and substance to various things. Using this same idea, you've explored using it to repair equipment.|  After much work, you've created the Aether Repairer, which consumes aether to fix tools, weapons, and armor.|  In experimenting, you've also quickly discovered differente materials take different amounts of aether to repair.",
    "research.aether_battery.name": "Aether Batteries",
    "research.aether_battery.desc": "Aether storage",
    "research.aether_battery.info": "  You originally created the aether bath to draw aether from your furnaces so you could produce more. However, it appears a large bowl and another sprite core wasn't enough to really create more aether storage.|  Using many of the same ideas, though, you were able to develop a block that was much better at storing aether from glass. These aether batteries are much better at storing aether, and even allow it to flow between nearby batteries.",
    "research.aether_battery_adv.name": "Advanced Aether Batteries",
    "research.aether_battery_adv.desc": "More expensive aether storage",
    "research.aether_battery_adv.info": "  Improving past the small aether battery to get the standard edition one was pretty easy. However, improving past that design took much more time. You've finally created aether batteries that store even more aether. The cost of each is more than the last, however.",
    "research.aether_gem.name": "Aether Gems",
    "research.aether_gem.desc": "Pockets of aether",
    "research.aether_gem.info": "  Aether batteries were a great exercise in aether storage. Using what you learned while creating them, you've created a new gem that can store a small amount of aether that you can fit in your pocket!|  Aether gems are charged up in baths or similar blocks. The energy they store will automatically be used by any other items in your inventory that use aether.",
    "research.aether_relay.name": "Aether Relays",
    "research.aether_relay.desc": "Aether distribution",
    "research.aether_relay.info": "  You've quickly realized that you don't have a good way to transfer aether around, making it quite difficult to work with. To solve this, you have created crystal relays which allow aether to flow through them.|  Relays do not store aether themselves, but let blocks that need aether pull the aether from some other block connected by relay. In the same breath, blocks that produce and push aether can use aether relays to push the aether into distant blocks.|  Relays can be connected to many other relays, allowing you to create a aether network of sorts.|  To use relays, you must place two relays and then use a GeoGem to connect them. Once they're connected, you can set the mode of the relay by right clicking it with an empty hand. Note that relays have three modes:|  - Input (green) where the relay will try to pull aether and put it into the machine it's attached to|  - Output (red) where the relay will pull aether from the machine it's attached to so that other relays can pull it|  - Pass (blue) mode, where the relay will take aether from other relays to help in passing it along to input relays.",
    "research.aether_unraveler.name": "Aether Unraveler",
    "research.aether_unraveler.desc": "Undo, Please",
    "research.aether_unraveler.info": "  Aether repairers are fantastic for repairing tools and equipment that has been damaged using the magical raw power of aether. But what if instead of repairing, you used the focused, purified energies to destroy?|  Aether Unravelers take spell scrolls and break them back down into their rune components. You will get all runes back that went into a spell. However, the aether cost is rather high!",
    "research.aether_carts.name": "Aether Carts",
    "research.aether_carts.desc": "Delivery!",
    "research.aether_carts.info": "  It took a little bit of magic elbow-grease, but you've slotted an Aether Battery in a minecart and got things moving!|  Aether Carts operate like Aether Batteries in that they store mana. To add or draw mana from the cart, you'll need to use an Aether Pump.|  Note that breaking the cart will make it lose all of its aether.",
	
	"research.enhanced_aether_relay.name": "Enhanced Relays",
	"research.enhanced_aether_relay.desc": "Aether Go Farrr",
	"research.enhanced_aether_relay.info": "  As you work with the relays (and especially the blue mode) you've noticed some places you can improve. Firstly, the relays have a relatively short range. Secondly, there are a LOT of aether bubbles flying around when your aether works really get going!|  Enhanced relays only have one mode, and can't actually store or input/output aether to a nearby machine. Instead, they have a large range and can pass aether between relays. What's more, they don't cause aether bubbles, cutting down on particle count and lag. They work like the blue mode relays.",
	
	"research.aether_sight_item.name": "Aether Sight",
	"research.aether_sight_item.desc": "Making Connections",
	"research.aether_sight_item.info": "  The Aether Sight Glass is a tool that, when held, lets you see connections between aether devices.",
	
	"research.aether_sight_pendant.name": "Aether Sight Pendant",
	"research.aether_sight_pendant.desc": "Just More Convenient",
	"research.aether_sight_pendant.info": "  Like the Aether Sight Glass, the Aether Sight Pendant allows you to see connections between aether devices. This version is wearable, though."
}